using System;
using System.Collections.Generic;
using System.Text;

namespace Billy.Data.Commands
{
    public class DailyMissions : IDataCommand
    {
        public string Name => "ЕЗ";
        public string Help => "Команда для работы с ежедневными заданиями.";
        public string FullHelp => "Команда предназначена для работы с ежедневными заданиями." +
            "\nИСПОЛЬЗОВАНИЕ:" +
            "\nДля того, чтобы Ваша груповая беседа была подписана на ежедневные задания нужно написать:" +
            "\nБилли, ЕЗ  подписаться" +
            "\nПосле подписки в Вашу груповую беседу будет приходить ОДНО задание В ДЕНЬ." +
            "\nЕжедневное задание является вопросом, на который нужно будет ответить." +
            "\nЗа правильный ответ Вы получаете Фоксы." +
            "\nДля того чтобы Ваш ответ был зачтён напишите:" +
            "\nБилли, ЕЗ ответ <Ваш ответ>" +
            "\nКоманда поддерживает следующие подкоманды:" +
            "\n-Подписаться" +
            "\n-Ответ" +
            "\n-Новое" +
            "\n-Отписаться" +
            "\n-Вопрос" +
            "\nДля того, чтобы в Вашу груповую беседу не приходили ежедневные задания, напишите:" +
            "\nБилли, ЕЗ отписаться" +
            "\nЕсли Вы забыли вопрос, можно попросить бота напомнить его:" +
            "\nБилли, ЕЗ вопрос";
        public static string NotCommand = "Вы не указали подкоманду.";
        public static string NoCommand = "Вы указали неверную подкоманду.";
        public static string ReadySubscribe = "Вы успешно подписали эту груповую беседу на получение ежедневных заданий!";
        public static string ReadyUnsubscribe = "Вы успешно отписали эту груповую беседу от получения ежедневных заданий!";
        public static string ChatIsSubscribe = "Груповая беседа уже подписана на получение ежедневных заданий.";
        public static string ChatIsUnsubscribe = "Груповая беседа не подписана на получение ежедневных заданий.";
        public static string Winner = "Вы успешно угадали слово! На ваш баланс добавлено 5 фоксов!";
        public static string Loser = "Неверное слово!";
        public static string NotAnswer = "На сегодня вопрос отгадан!";
        public static string NewAnser = "Вы сгенерировали новый вопрос для этой беседы.";
        public static string NoChat = "Команда доступна только в груповых беседах.";
        public static string noSay = "А жульничать - плохо!";
        public static string Trigger(int index)
        {
            string text = $"Вот ваш вопрос на сегодня:\n {quessions[index]} \n Если вы забыли вопрос, напишите:\n Билли, ЕЗ вопрос";
            return text;
        }
        public static string[] quessions =
       {
            "Зимой – серый, летом – белый. Кто это?",
            "Правда ли, что зимой деревья тоже растут?",
            "Чем, согласно пословице, зимой не дорожат?",
            "Сколько лучей у обычной снежинки?",
            "Какой полюс холоднее – Северный или Южный?",
            "Как называют птиц, которые улетают зимовать в другие края?",
            "Жир на зиму бобр накапливает именно в этой части тела. В какой?",
            "Про какой зимний месяц говорят, что он – весне дедушка?",
            "Согласно народным приметам, какую зиму предвещает большой урожай рябины?",
            "Этот праздник у древних славян назывался «Проводы зимы». А какое название еще есть у этого праздника?",
            "Какое название носит кактус, который зацветает только зимой?",
            "Верно ли утверждение, что в мире не существует двух одинаковых снежинок?",
            "Какое животное каждый год 2 февраля вылезает из норы в американском городе и предсказывает погоду?",
            "На 95% снежинки состоят именно из этого. Из чего?",
            "Какой царь ввел обычай праздновать Новый год и ставить елки в домах?",
            "Кто это? На цветке цветок пьет цветочный сок.",
            "Как называется слабый дождь, при котором на небе нет туч, и часто светит солнце, после которого начинают расти грибы?",
            "Что, согласно пословице, лучше готовить летом, если телегу лучше готовить зимой?",
            "Самая «солнечная» фигура в геометрии?",
            "Если вокруг муравейника много муравьев, какая погода, согласно народным приметам, нас ждет?",
            "Этот месяц называет закатом лета. Какой?",
            "Людей с какой группой крови чаще кусают комары?",
            "Продолжите пословицу: «Каково лето, таково и …»",
            "Какой летний цветок вырастает на месте лесных пожарищ?",
            "По преданию папоротник цветет именно в эту летнюю ночь.",
            "В какой книге писатель рассказывает о человечках-коротышках?",
            "Что разбил Миша в сказке «Леденец», когда лез за лакомством?",
            "Из какой книги Носова дети могут легко понять, что такое реклама, безработица, забастовка и т.д.?",
            "Кто из коротышек был поэтом?",
            "В этом рассказе Стасик и Мишутка сочиняли небылицы. Как он называется?",
            "Какой овощ в сказке «Живая шляпа» швырял в шляпу Володя?",
            "Какое животное спряталось под шляпу в рассказе «Живая шляпа»?",
            "В рассказе «Заплатка» у мальчика необычное имя. Какое?",
            "На что Виталик в сказке «Карасик» обменял рыбку?",
            "В рассказе «Дружок» у тети Наташи была собака. Как ее звали?",
            "В одном из рассказов Носова главный герой – это общественный транспорт. Какой?",
            "Что в рассказе «Федина задача» мешало мальчику делать уроки?",
            "Какой рассказ писателя был опубликован первым?",
            "Носов взял имя Незнайка у персонажа сказок русской писательницы. Назовите ее.",
            "Образ Незнайки, по словам писателя, был списан с одного из его родственников. С кого?",
            "Кто получил первую Нобелевскую премию по физике?",
            "Эта женщина в виде исключения дважды была лауреатом Нобелевской премии. Назовите ее.",
            "Каждые сутки Земля «поправляется» на 400 т. За счет чего?",
            "Кто создал первый паровой двигатель в мире?",
            "Что такое диэлектрик для физика?",
            "«Усиление света в результате вынужденного излучения». Что это?",
            "Какой термометр появился первым?",
            "Какой металл является самым тугоплавким?",
            "Какая жидкость самая легкая?",
            "Какое поле появляется вокруг любого предмета?",
            "Как называется аналог Масленицы у католиков и лютеран?",
            "Закончите поговорку: <<Милости просим к нам об Масленице с своим добром, с...>>",
            "Как называется праздник Масленица по церковному уставу?",
            "Что определяет начало время наступления Масленицы?",
            "Как называется неделя, следующая за Масленицей?",
            "Как называется день перед началом Масленничной недели?",
            "Кто автор картины <<Взятие снежного городка>>?",
            "Как называется Масляница у армян?",
            "Какой патриарх сократил празднование Масленицы до одной недели?",
            "Кто автор пьесы <<Не всё коту масленица>>?",
            "Сколько в среднем весят мышцы человека?",
            "Из скольких клеток состоит тело человека?",
            "Назовите количество типов тканей человека.",
            "Какая мышца в теле человека является самой крупной?",
            "Какая кость в скелете - самая длинная?",
            "Где находятся самые маленькие кости человека?",
            "Сколько процентов воды содержит кость?",
            "Сколько мышц в теле человека?",
            "Сколько рецепторов-палочек находится в глазу человека?",
            "Сколько рецепторов-колбочек находится в глазу человека?",
            "Какой диапазон частот способно улавливать ухо человека?",
            "Какова площадь дыхательной поверхности легких?",
            "Какие кровяные клетки существуют?",
            "Сколько костей в скелете человека?",
            "Какова средняя длина всех сосудов человека?",
            "Сколько нейронов содержит нервная система человека?",
            "Какую площадь имеет кожа человека?"

        };

        public static string[] answers =
        {
            "заяц",
            "нет",
            "льдом",
            "шесть",
            "южный",
            "перелётные птицы",
            "в хвосте",
            "январь",
            "холодную",
            "масленица",
            "декабрист",
            "да",
            "сурок фил",
            "из воздуха",
            "петр первый",
            "бабочка",
            "грибной",
            "готовь сани летом, а телегу – зимой",
            "луч",
            "солнечная",
            "август",
            "первой",
            "сено",
            "иван-чай",
            "в ночь ивана купалы",
            "Приключения незнайки",
            "сахарницу",
            "незнайка на луне",
            "цветик",
            "фантазёры",
            "картофель",
            "кот",
            "бобка",
            "на милицейский свисток",
            "дианка",
            "метро",
            "радио",
            "затейники",
            "Анна Хвольсон",
            "с сына пети",
            "вильгельм рентген",
            "мария склодовская–кюри",
            "космической пыли",
            "иван ползунов",
            "воздух",
            "лазер",
            "фаренгейта",
            "вольфрам",
            "сжиженный водород",
            "гравитационное",
            "жирный вторник",
            "честным животом",
            "сырная седмица",
            "великий пост",
            "федорова неделя",
            "мясное воскресенье",
            "суриков",
            "бун барекендан",
            "адриан",
            "островский",
            "28 кг",
            "10^15",
            "4",
            "большая ягодичная",
            "бедренная кость",
            "в ухе",
            "22",
            "600",
            "110-130 млн",
            "6-7 млн",
            "от 16 гц до 122 кгц",
            "90",
            "эритроциты, лейкоциты, тромбоциты",
            "200",
            "100000 км",
            "10 млд",
            "2 кв м"
        };
    }
}
